feh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-28 Wed 14:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>feh</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">feh</h1>
<p>
feh is a somewhat minimal image viewer
</p>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> keybinds</h2>
<div class="outline-text-2" id="text-1">
<p>
some of the keybinds arent very well documented
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">use</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">zoom (out) so that the whole thing fits on your screen</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">go back to the center and reset zoom</td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left">toggle fullscreen</td>
</tr>

<tr>
<td class="org-left"><code>Z</code></td>
<td class="org-left">seems to do the same thing as <code>/</code>, but only in fullscreen</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> set wallpaper</h2>
<div class="outline-text-2" id="text-2">
<p>
you can use feh for setting your wallpaper with <code>--bg-fill</code>. you can
have a random wallpaper by pointing it at a directory and using
<code>--randomize</code>
</p>
</div>
</div>
</div>
</body>
</html>
